#include <iostream>
#include "Menu.h"

using namespace std;

void printDivLine() {
	cout << "-------------------------------------------------------------" << endl;
}

void userhi() {
	printf("user > ");
}

void userhi(char* string) {
	printf("user/%s > ", string);
}


void help() {
	setlocale(LC_ALL, "Russian");
	std::cout << "---------------------------------------" << std::endl
		<< "меню" << std::endl
		<< "------------------------------------------ |" << std::endl
		<< "[p] - вывести коллекцию                    |" << std::endl
		<< "[a] - добавить книгу                       |" << std::endl
		<< "[d] - удалить книгу                        |  " << std::endl
		<< "[s] - сохранить в файл                     |" << std::endl
		<< "[l] - загрузить книги из коллекции         |" << std::endl
		<< "[t] - сортировать книги                    | " << std::endl
		<< "[n] - сама€ попул€рна€ категори€           |" << std::endl
		<< "------------------------------------------ |" << std::endl
		<< "[b] - заполнить картотеку обычными книгами |" << std::endl
		<< "[x] - очистить файл                        |" << std::endl
		<< "[z] - очистить колекцию                    |" << std::endl
		<< "------------------------------------------ |" << std::endl
		<< "[h] - меню                                 |" << std::endl
		<< "[q] - закрыть программу                    |" << std::endl
		<< "[c] - загрузить удаленную книгу            |" << std::endl
		<< "------------------------------------------ |" << std::endl;
}